---
kind: other
id: Methods.T:Autodesk.Revit.DB.ShapeImporter
source: html/65042489-4271-8f42-385f-283e988905e8.htm
---
# ShapeImporter Methods

Converts the geometry stored in the external format into a collection of Revit geometry objects.